Revit 2024 API
FilterableValueProvider Members
The FilterableValueProvider type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the FilterableValueProvider
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAssociatedGlobalParameterValue
 Gets a global parameter value associated with a parameter from the given element.
GetDoubleValue
 Gets a double-precision numeric value from the given element.
GetElementIdValue
 Gets an ElementId value from the given element.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetIntegerValue
 Gets an integer value from the given element.
GetStringValue
 Gets a string value from the given element.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsDoubleValueSupported
 Determines whether the provide can provide a double-precision numeric value for the given element.
IsElementIdValueSupported
 Determines whether the provide can provide an ElementId value for the given element.
IsIntegerValueSupported
 Determines whether the provide can provide an integer value for the given element.
IsStringValueSupported
 Determines whether the provide can provide a string value for the given element.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
FilterableValueProvider Class
Autodesk.Revit.DB Namespace